SBOM_LIFECYCLE.md
```mermaid
---
title: SBOM Producer Life Cycle
---
graph LR
    %% Authoring subgraph
    subgraph Authoring
        Generation --> Augmentation
        Augmentation --> Enrichment
        Enrichment --> Validation
        Validation --> Signing
    end

    %% Main flow
    Signing --> Transportation
    Transportation --> Analysis
```
