assets/lifecycle.d2
direction: right

title: |md

  # SBOM Producer Life Cycle

| {near: top-center}

Authoring {
  Generation
  Augmentation
  Enrichment
  Validation
  Signing
}

Transportation {

}

Analysis {

}

Authoring.Generation -> Authoring.Augmentation
Authoring.Augmentation -> Authoring.Enrichment
Authoring.Enrichment -> Authoring.Validation
Authoring.Validation -> Authoring.Signing
Authoring.Signing -> Transportation -> Analysis
